---
kind: property
id: P:Autodesk.Revit.UI.UIView.ViewId
source: html/402ac1fa-235d-e8fb-f56e-f83836bea79a.htm
---
# Autodesk.Revit.UI.UIView.ViewId Property

The id of the View associated with a UIView.

## Syntax (C#)
```csharp
public ElementId ViewId { get; }
```